Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: calculate with powers with rational exponents and numbers in scientific notation, algebraic expressions, formulas, expressions with brackets and alphanumerical rational and square expressions, use quadratic equations to factor algebraic expressions
nb: regne med rotuttrykk, potenser med rasjonal eksponent og tall på standardform, bokstavuttrykk, formler, parentesuttrykk og rasjonale og kvadratiske uttrykk med tall og bokstaver, faktorisere kvadratiske uttrykk, bruke kvadratsetningene og lage fullstendige kvadrat

source: “And we have fewer rules.”
nb: – Det blir også mindre regler.

source: Updated fourth edition published September 28th 2020
nb: versjon publisert 28. september 2020

source: They challenge themselves more.
nb: De utfordrer seg selv mer.

source: make estimates of answers, calculate with practical tasks, with and without technical aids, and assess how reasonable the results are
nb: gjøre overslag over svar, regne praktiske oppgaver, med og uten digitale verktøy, presentere resultatene og vurdere hvor rimelige de er

source: The goal of the recommendations is to limit the spread of Covid-19.
nb: Formålet med rådene er å begrense spredning av covid-19.

source: the purpose of this use of history
nb: fortiden ved å formulere problemstillinger, finne,

source: The main subject area is concerned with how natural disasters affect nature, society and human beings.
nb: Hovedområdet handler om hvordan naturkatastrofer rammer natur, samfunn og mennesker.

source: explain the reasons why there are two equal language forms and give an account of the language debates and linguistic variations in Norway in the present day
nb: forklare bakgrunnen for at det er to likestilte norske målformer og gjøre rede for språkdebattene og de språklige variasjonene i Norge i dag

source: explain multilingualism and give examples of how linguistic and cultural interaction may contribute to linguistic changes and cultural awareness
nb: explain multilingualism and give examples of how linguistic and cultural interaction may contribute to linguistic changes and cultural awareness gjøre rede for likheter og forskjeller mellom de nordiske språkene og mellom norrønt og moderne norsk språk

source: Lisbeth Ljosdal Skreland worked in a kindergarten for 18 years before she started studying kindergartens for research purposes.
nb: Lisbeth Ljosdal Skreland jobbet i barnehage i 18 år før hun begynte å forske på barnehager.

source: use different types of digital and paper-based dictionaries
nb: bruke teknologi for å oppleve språket via autentiske språkmodeller og

source: plan, implement and evaluate a production schedule with numbers, growth rate, biomass, density, water and oxygen requirements and feed consumption
nb: planlegge, gjennomføre og vurdere en produksjonsplan med antall, tilvekst, biomasse, tetthet, vannbehov, oksygenbehov og fôrforbruk

source: collected data to make explanations,
nb: innsamlede data til å lage forklaringer,

source: It also includes utilizing various programmes for processing information and presenting tables, graphical presentations and maps.
nb: Det innebærer også å benytte forskjellige programmer til å bearbeide informasjon og presentere tabeller, grafiske framstillinger og kart.

source: give an account of theories of what causes crime, assess society’s response system, and elaborate on and discuss measures that might prevent crime
nb: gjøre rede for teorier om årsaker til kriminalitet, vurdere samfunnets reaksjonssystem og drøfte tiltak som kan forebygge kriminalitet

source: Pedagogical documentation is useful as a tool, but it can also be ethically challenging.
nb: Pedagogisk dokumentasjon er nyttig som verktøy, men kan også være etisk utfordrende.

source: Both functions reach their maximum of 1 just once in each period.
nb: Begge funksjonene oppnår sitt maksimum 1 én gang i hver periode.

source: It also involves comparing, discussing and elaborating on causes, effects and interrelationships.
nb: Det innebærer også å sammenligne og drøfte årsaker, virkninger og sammenhenger.

source: ECEC institutions have a tendency to resolve conflicts quickly and smoothly.
nb: I barnehagen er det en tendens til at konflikter skal løses raskt og smidig.

source: in RLE involves being able to express knowledge and viewpoints about religion and philosophies of life, ethics and philosophy.
nb: i RLE innebærer å kunne uttrykke kunnskaper om og synspunkter på religion og livssyn, etikk og filosofi.

source: Both variants qualify candidates for higher education together with either the common core programme subject Mathematics at level Vg2 (2P) or the programme subject Mathematics (R1/S1).
nb: Begge variantene gir i de studieforberedende utdanningsprogrammene generell studiekompetanse sammen med matematikk på Vg2, enten 2P eller programfag i matematikk (R1/S1).

source: After Year 4
nb: Etter 4. årstrinn

source: It also encompasses recent localization theory and the effect of technology on the global economy, the division of labour and the environment.
nb: Videre dreier det seg om nyere lokaliseringsteori og teknologiens innvirkning på global økonomi, arbeidsdeling og miljø.

source: explain the structure of the Bible, find their way through biblical texts and reflect on the relationship between the Bible, language and culture
nb: forklare Bibelens oppbygning, finne fram i bibelske tekster og reflektere over forholdet mellom Bibelen og språk og kultur

source: write creative, informative and persuasive texts, reports, literary analyses, discussions and other expository texts
nb: skrive kreative, informative og argumenterende tekster, utgreiinger, litterære tolkninger, drøftinger og andre resonnerende tekster

source: The main subject area Knowledge and the pursuit of truth is concerned with the scientific method.
nb: dreier seg om hvordan endringer i produksjon og forbruk har preget menneskers hverdag og forestillinger.

source: Rossholt postulates that gender becomes very clear at the time when the children leave the toddlers’ unit.
nb: Rossholt mener at kjønn for alvor blir tydelig når barna forlater småbarnsavdelingen.

source: Figure 2.11 Percentage of mathematics teachers (3MX in Norway) stating that they have participated in relevant in-service courses in various topics during the past two years
nb: Figur 2.11 Prosentandelen av matematikklærerne (3MX i Norge) som oppgir at de har deltatt i faglig relevant etter- og videreutdanning i ulike temaer de siste to årene.

source: This main subject area also covers Geography Information systems (GIS) and other background information, such as statistics, satellite images, radar plotting, weather maps and weather forecasting.
nb: Videre omfatter hovedområdet GIS (geografiske informasjonssystemer) og annen bakgrunnsinformasjon, som statistikk, satellittbilder, radarplott, værkart og værprognoser.

source: ‘It is not obvious to a child who is entitled to ownership.
nb: Den er ikke like åpenbar for barnet som retten til eiendom.

source: They learn about unity and how to support each other.
nb: De lærer om samhold og hvordan man støtter hverandre.

source: All the same, a face-to-face meeting may be necessary.
nb: Kohorter må i minst mulig blandes med andre kohorter.

source: The programme subject shall develop competence that can serve as a basis for participation in vocational life and for further studies.
nb: Programfaget skal utvikle kompetanse som kan danne grunnlag for deltakelse i arbeids- og yrkesliv og for videre studier.

source: Writing Norwegian is also a way of developing and structuring thoughts and a method for learning.
nb: Skriving er en måte å utvikle og strukturere ideer og tanker på, men det er også en kommunikasjonsform og en metode for å lære.

source: In religion and ethics the basic skills are understood as follows:
nb: I religion og etikk forstås grunnleggende ferdigheter slik:

source: Communication is achieved through listening, reading, writing, prepared oral production and spontaneous oral interaction, including the use of appropriate communication strategies.
nb: Kommunikasjon skjer gjennom lytting, lesing, skriving, forberedt muntlig produksjon og spontan muntlig samhandling, også med bruk av hensiktsmessige kommunikasjonsstrategier.

source: Furthermore, it is concerned with current issues and regional and international conflicts in the English-speaking world.
nb: Det dreier seg også om aktuelle spørsmål og regionale og internasjonale konflikter i den engelskspråklige verden.

source: investigate how traditional crafts, including Sami crafts, utilise the
nb: undersøke hvordan tradisjonshåndverk, inkludert samisk håndverk,

source: identify important linguistic similarities and differences between English and the native language and use this knowledge in his or her own language learning
nb: identifisere vesentlige språklige likheter og forskjeller mellom engelsk og eget morsmål og utnytte dette i egen språklæring

source: It also covers historical events and processes that have affected the development of society in Great Britain and the United States.
nb: Det omfatter også historiske hendelser og prosesser som har påvirket utviklingen av det britiske og det amerikanske samfunnet.

source: More than 70 per cent of the children in the survey responded that they can never refuse to take part in these activities.
nb: Over 70 prosent av barna i undersøkelsen svarte at de aldri kan si nei til å være med på disse aktivitetene.

source: In Mathematics X this involves having confidence in applying various arithmetical operations without the use of digital tools.
nb: I matematikk X innebærer det fortrolighet med de ulike regneoperasjonene, uten bruk av digitale verktøy.
